Repository: kimpiffy/theenglishstudiocorvetto
Catalog: locale/*/LC_MESSAGES/django.po
Languages: it

source: Select an option
it: Seleziona un'opzione

source: Full Name
it: Nome e Cognome

source: Phone
it: Telefono

source: Subject
it: Oggetto

source: Message
it: Messaggio

source: Subscribe to newsletter
it: Iscriviti alla newsletter

source: The English Studio Logo - Navigate Home
it: The English Studio Logo - Naviga alla Home

source: About
it: Informazioni

source: Gallery
it: Galleria

source: Schedule
it: Orario

source: Contact
it: Contatto

source: English
it: Inglese

source: Italian
it: Italiano

source: Staff
it: Personale

source: Privacy Policy
it: Informativa sulla privacy

source: Made with ♥ by Kim Piffy
it: Fatto con ♥ da Kim Piffy

source: MORE POSTS
it: ALTRI POST

source: Go Back
it: TORNA INDIETRO

source: Contact Us
it: Contattaci

source: After School Club
it: Dopo Scuola

source: Private Lessons
it: Lezioni Private

source: Business English Lessons
it: Lezioni di Inglese Commerciale

source: General English Lessons
it: Lezioni di Inglese Generale

source: IELTS Enquiry
it: Richiesta per IELTS

source: Other
it: Altro

source: Send Message
it: Invia messaggio

source: Where to find us
it: Dove trovarci

source: Address
it: Indirizzo

source: Thank you!
it: Grazie!

source: We look forward to embarking on this exciting journey with you!
it: Non vediamo l'ora di intraprendere questo entusiasmante viaggio con voi!

source: We aim to reply within 1–2 working days.
it: Puntiamo a rispondere entro 1-2 giorni lavorativi.

source: Upcoming Events
it: Eventi in Arrivo

source: Click on a flyer to find out more
it: Clicca su un volantino per saperne di più

source: VIEW THE SCHEDULE
it: VISUALIZZA IL CALENDARIO

source: AFTER SCHOOL CLUBS
it: DOPOSCUOLA

source: An environment where children feel truly excited to learn English!
it: Un ambiente in cui i bambini si sentono davvero entusiasti di imparare l’inglese!

source: Learn More
it: Scopri di più

source: BUSINESS ENGLISH
it: INGLESE COMMERCIALE

source: Access to a career of opportunities is only one lesson away.
it: L’accesso a una carriera piena di opportunità è a una sola lezione di distanza.

source: ONE-ON-ONE’S
it: LEZIONI INDIVIDUALI

source: Bespoke lessons designed to help you gain your confidence.
it: Lezioni su misura pensate per aiutarti a ritrovare la tua sicurezza.

source: TEST PREPS
it: PREPARAZIONE AI TEST

source: Be prepared to unlock your potential to reach your academic goals.
it: Preparati a sbloccare il tuo potenziale per raggiungere i tuoi obiettivi accademici.

source: Teacher
it: Insegnante

source: Learn English with Confidence
it: Impara l’inglese con sicurezza

source: Hi, I'm Leanne! Welcome to The English Studio in Corvetto — a space where learning English is fun, engaging, and designed just for you. I’m originally from England and now call Milan home. Over the years, I’ve taught adults, teens, little ones, business groups, IELTS and TOEIC students, and I’ve also hosted creative clubs and CLIL projects in schools. Alongside this experience, I hold a CELTA qualification, TEFL certification, and a First-Class Honours degree, and I regularly take part in ongoing professional training for young learners and teenagers. All of this shapes my approach to teaching: lessons that are friendly, interactive, and carefully tailored to each student.
it: Ciao, sono Leanne! Benvenuti a The English Studio in Corvetto — uno spazio accogliente dove imparare l’inglese è divertente, coinvolgente e pensato su misura per te. Sono originaria dell’Inghilterra e oggi vivo a Milano. Negli anni ho insegnato a adulti, adolescenti, bambini piccoli, gruppi aziendali, studenti IELTS e TOEIC, e ho anche organizzato club creativi e progetti CLIL nelle scuole. Accanto a questa esperienza, possiedo la certificazione CELTA, la qualifica TEFL e una laurea con lode, e continuo a formarmi regolarmente nell’insegnamento a bambini e ragazzi. Tutto questo ha plasmato il mio approccio: lezioni dinamiche, interattive e personalizzate sulle esigenze di ogni studente.

source: At The English Studio, we focus on real learning — building confidence, connecting ideas, sharing stories, and using English naturally. For children, lessons are playful and immersive, helping them absorb grammar and vocabulary in fun, meaningful ways. For adults, lessons are personalised to your specific goals, helping you move past plateaus and achieve real progress.
it: A The English Studio ci concentriamo sull’apprendimento reale: costruire sicurezza, collegare idee, condividere storie e usare l’inglese in modo naturale. Per i bambini, le lezioni sono giocose e immersive, per permettere loro di acquisire grammatica e vocabolario in modo divertente e significativo. Per gli adulti, le lezioni sono personalizzate in base ai tuoi obiettivi specifici, per aiutarti a superare i blocchi e fare progressi concreti con l’inglese.

source: Whether you’re 3 or 103, a beginner or advanced learner, there’s a place for you here. Lessons are personalised, engaging, and designed to help you reach your goals in a supportive and inspiring environment. Get in touch today or pop by to see what our lessons are like — I can’t wait to meet you!
it: Che tu abbia 3 o 103 anni, che tu sia principiante o di livello avanzato, qui c’è spazio per te. Le lezioni sono coinvolgenti, su misura e pensate per aiutarti a raggiungere i tuoi obiettivi in un ambiente di supporto e stimolante. Contattami o passa a trovarmi per scoprire com’è una lezione — non vedo l’ora di conoscerti!

source: The world is a spectacular place, but without English, many doors remain closed. Unlock new opportunities with English today.
it: Il mondo è un posto straordinario, ma senza l’inglese molte porte restano chiuse. Apri nuove opportunità con l’inglese, oggi.

source: What We Offer
it: Cosa Offriamo

source: Join us after school for the perfect environment where your kids can learn English in a fun and exciting way! Each session is packed with energy and creativity, helping children consolidate grammar in refreshing, practical ways — turning what they learn in school into real, spoken, and written English.
it: Unisciti a noi dopo scuola per offrire ai tuoi bambini l’ambiente perfetto dove imparare l’inglese in modo divertente ed entusiasmante! Ogni lezione è piena di energia e creatività, aiutando i bambini a consolidare la grammatica in modi pratici e stimolanti — trasformando ciò che imparano a scuola in inglese parlato e scritto reale.

source: Expose your children to the world and help them acquire fundamental language skills at a young age, preparing them for their best possible future.
it: Esporre i bambini al mondo e aiutarli ad acquisire competenze linguistiche fondamentali fin da piccoli li prepara al loro futuro migliore.

source: One-on-one or group lessons available for teens seeking extra academic support.
it: Lezioni individuali o di gruppo disponibili per adolescenti che desiderano supporto extra nello studio.

source: With an excellent academic record, our teacher is confident she can use creative methods to help you reach your goals. Lessons are designed not only to help you fully understand grammar, but also to find practical, relatable ways to apply the rules you learn at school in your daily life. Every lesson helps you elevate your English and get closer to meeting your academic needs — one lesson at a time.
it: Con un eccellente curriculum accademico, la nostra insegnante è sicura di poter usare metodi creativi per aiutarti a raggiungere i tuoi obiettivi. Le lezioni sono progettate non solo per farti comprendere appieno la grammatica, ma anche per mostrarti modi pratici e concreti per applicare le regole che impari a scuola nella vita quotidiana. Ogni lezione ti aiuta a migliorare il tuo inglese e ad avvicinarti ai tuoi obiettivi accademici — una lezione alla volta.

source: Comprehensive lessons covering all academic bases! What better place to prepare for British Council exams than with a native British teacher with an excellent academic record?
it: Lezioni complete che coprono tutti gli aspetti accademici! Che posto migliore per prepararsi agli esami del British Council se non con un’insegnante madrelingua britannica con un eccellente curriculum accademico?

source: Our teacher knows all the tips and tricks to help you achieve the top marks you need to reach your target score! Lessons are personalised to your strengths and weaknesses, giving you the confidence, strategies, and practice to succeed one step at a time.
it: La nostra insegnante conosce tutti i trucchi per aiutarti a ottenere i voti migliori e raggiungere il punteggio che desideri! Le lezioni sono personalizzate in base ai tuoi punti di forza e alle tue aree di miglioramento, offrendoti sicurezza, strategie e pratica per avere successo un passo alla volta.

source: ADULTS
it: ADULTI

source: English for yourself — discover how our bespoke lessons can transform your journey.
it: Inglese per te — scopri come le nostre lezioni su misura possono trasformare il tuo percorso.

source: Learn English in a way you’ve never experienced before: have fun, engage fully, and unlock your potential. Our teacher has all the tools to help you come out of your shell and connect the grammar ingrained in your mind to produce beautifully spoken and written English.
it: Impara l’inglese in un modo che non hai mai sperimentato prima: divertiti, partecipa attivamente e libera il tuo potenziale. La nostra insegnante ha tutti gli strumenti per aiutarti a uscire dal tuo guscio e collegare la grammatica che hai già assimilato alla produzione di un inglese parlato e scritto in modo chiaro e naturale.

source: Don’t worry — our school is a judgement-free space where effort is always praised, and our goal is simple: to help you feel confident in yourself and your English.
it: Non preoccuparti — la nostra scuola è uno spazio senza giudizi, dove ogni impegno viene sempre apprezzato. Il nostro obiettivo è semplice: aiutarti a sentirti sicuro di te e del tuo inglese.

source: Our teacher isn’t here to criticise, but to mentor you — and to learn from you too.
it: La nostra insegnante non è qui per criticarti, ma per guidarti come mentore — e per imparare da te allo stesso tempo.

source: Available online or in-person — sharpen your Business English skills and get the promotion you’ve always dreamed of!
it: Disponibile online o in presenza — perfeziona il tuo Business English e ottieni la promozione che hai sempre sognato!

source: English is the most widely spoken international business language, and missing out on clear, confident communication means missing top opportunities. Together with our teacher, we’ll design a course tailored specifically to your goals and professional needs.
it: L’inglese è la lingua più diffusa nel mondo degli affari e non saper comunicare in modo chiaro e sicuro significa perdere grandi opportunità. Insieme alla nostra insegnante, progetteremo un corso su misura, pensato appositamente per i tuoi obiettivi e le tue esigenze professionali.

source: WORKSHOPS & ACTIVITIES
it: LABORATORI & ATTIVITÀ

source: English workshops and activities in collaboration with local artists and teachers!
it: Laboratori e attività di inglese in collaborazione con artisti e insegnanti locali!

source: At The English Studio, we’re always working to provide you with opportunities to use English creatively and have fun while learning.
it: A The English Studio lavoriamo sempre per offrirti opportunità di usare l’inglese in modo creativo e divertirti mentre impari.

source: Follow us on Instagram for the latest updates — you won’t want to miss out!
it: Seguici su Instagram per rimanere aggiornato — non vorrai perderti nulla!

source: CONTACT US
it: Contattaci

source: Last updated
it: Ultimo aggiornamento

source: On this page
it: In questa pagina

source: 1) Who we are
it: 1) Chi siamo

source: 2) Data we collect
it: 2) Dati che raccogliamo

source: 3) How we collect
it: 3) Come raccogliamo i dati

source: 4) Purposes & legal bases
it: 4) Finalità e basi giuridiche

source: 5) Cookies
it: 5) Cookie

source: 6) Sharing your data
it: 6) Condivisione dei dati

source: 7) International transfers
it: 7) Trasferimenti internazionali

source: 8) Data retention
it: 8) Conservazione dei dati

source: 9) Security
it: 9) Sicurezza

source: 10) Your rights
it: 10) I tuoi diritti

source: 11) Children’s privacy
it: 11) Privacy dei minori

source: 12) Third-party links
it: 12) Link a siti di terzi

source: 13) Changes
it: 13) Modifiche

source: 14) Contact
it: 14) Contatti

source: 1) Who we are (Data Controller)
it: 1) Chi siamo (Titolare del trattamento)

source: Controller
it: Titolare

source: Website
it: Sito web

source: We comply with UK GDPR and Data Protection Act 2018. If you are in the EEA, we may appoint an EU representative on request.
it: Rispettiamo l’UK GDPR e il Data Protection Act 2018. Se ti trovi nello SEE, potremmo nominare un rappresentante nell’UE su richiesta.

source: 2) Personal data we collect
it: 2) Dati personali che raccogliamo

source: Identity & contact
it: Identità e contatti

source: name, email, phone, address
it: nome, email, telefono, indirizzo

source: Account (portal)
it: Account (portale)

source: username, hashed password, roles
it: username, password cifrata, ruoli

source: Course & booking
it: Corsi e prenotazioni

source: class booked, dates/times, attendance, payment status
it: corso prenotato, date/orari, presenze, stato dei pagamenti

source: Child participant (via parent/guardian)
it: Partecipante minorenne (tramite genitore/tutore)

source: first name, age, special requirements, emergency contact
it: nome, età, esigenze particolari, contatto di emergenza

source: Communications & preferences
it: Comunicazioni e preferenze

source: messages, feedback, marketing opt-in/out
it: messaggi, feedback, consensi/revoche marketing

source: Images & media (optional)
it: Immagini e media (opzionale)

source: photos/video from events, only with consent where required
it: foto/video di eventi, solo con consenso quando richiesto

source: Technical & usage
it: Dati tecnici e di utilizzo

source: IP, device/browser, pages viewed, cookie IDs
it: IP, dispositivo/browser, pagine visitate, identificativi cookie

source: Special category data
it: Dati particolari

source: we do not intentionally collect special categories (e.g., health) except where you volunteer details for reasonable adjustments. In that case we rely on explicit consent or vital interests.
it: non raccogliamo intenzionalmente categorie particolari (es. salute) salvo tu fornisca volontariamente informazioni per adeguamenti ragionevoli. In tal caso ci basiamo sul consenso esplicito o sugli interessi vitali.

source: 3) How we collect data
it: 3) Come raccogliamo i dati

source: Directly from you (forms, bookings, portal accounts, email/messages, media consent)
it: Direttamente da te (moduli, prenotazioni, account del portale, email/messaggi, consensi media)

source: Automatically via privacy-preserving logs when you browse our website/portal
it: Automaticamente tramite log rispettosi della privacy quando navighi il nostro sito/portale

source: From third parties (e.g., payment providers, analytics, social platforms)
it: Da terze parti (es. provider di pagamento, analytics, piattaforme social)

source: 4) Why we use your data (purposes & legal bases)
it: 4) Perché usiamo i tuoi dati (finalità e basi giuridiche)

source: Purpose
it: Finalità

source: Examples
it: Esempi

source: Legal basis
it: Base giuridica

source: Provide our services
it: Fornire i nostri servizi

source: run classes, manage bookings/accounts, support
it: gestire corsi, prenotazioni/account, assistenza

source: Contract
it: Contratto

source: Communications
it: Comunicazioni

source: enquiry replies, service messages (schedule changes)
it: risposte alle richieste, avvisi di servizio (variazioni di orario)

source: Legitimate interests / Contract
it: Interessi legittimi / Contratto

source: newsletters, updates on classes/events
it: newsletter, aggiornamenti su corsi/eventi

source: Consent / Legitimate interests (PECR-permitted)
it: Consenso / Interessi legittimi (dove consentito da PECR)

source: Payments
it: Pagamenti

source: processing via payment provider; tax records
it: elaborazione tramite provider di pagamento; adempimenti fiscali

source: Contract / Legal obligation
it: Contratto / Obbligo legale

source: Photos & media
it: Foto e media

source: showcasing activities on site/socials
it: raccontare le attività sul sito/sui social

source: Consent
it: Consenso

source: Safety & compliance
it: Sicurezza e conformità

source: fraud prevention, safeguarding, legal claims
it: prevenzione frodi, tutela, gestione di azioni legali

source: Legitimate interests / Legal obligation / Vital interests
it: Interessi legittimi / Obbligo legale / Interessi vitali

source: Analytics & improvement
it: Analisi e miglioramento

source: privacy-preserving, cookieless measurement to improve the site
it: misurazioni senza cookie e rispettose della privacy per migliorare il sito

source: Legitimate interests
it: Interessi legittimi

source: Where we rely on consent, you may withdraw it at any time. Where we rely on legitimate interests, we balance our interests with your rights and expectations.
it: Se ci basiamo sul consenso, puoi revocarlo in qualsiasi momento. Se ci basiamo sugli interessi legittimi, bilanciamo i nostri interessi con i tuoi diritti e le tue aspettative.

source: We do not use cookies on this website. If this changes, we will update this page and request consent where required.
it: Non utilizziamo cookie su questo sito web. Se ciò dovesse cambiare, aggiorneremo questa pagina e richiederemo il consenso ove necessario.

source: We share personal data only when necessary, with:
it: Condividiamo i dati personali solo quando necessario, con:

source: Service providers (processors)
it: Fornitori di servizi (responsabili del trattamento)

source: hosting, email delivery, cloud media, analytics, payments, forms
it: hosting, invio email, archiviazione cloud, analytics, pagamenti, moduli

source: they act on our instructions and keep it secure
it: operano su nostre istruzioni e mantengono i dati sicuri

source: Legal/compliance
it: Autorità e conformità

source: regulators, law enforcement, courts or advisors when required
it: autorità, forze dell’ordine, tribunali o consulenti quando richiesto

source: Business changes
it: Operazioni societarie

source: reorganisation/transfer under appropriate safeguards
it: riorganizzazione/trasferimento con adeguate garanzie

source: We do not sell your personal data.
it: Non vendiamo i tuoi dati personali.

source: Where providers are outside the UK/EEA, we use adequacy decisions, Standard Contractual Clauses (SCCs) with safeguards, or other lawful mechanisms.
it: Quando i fornitori si trovano fuori da UK/SEE, utilizziamo decisioni di adeguatezza, Clausole Contrattuali Standard (SCC) con garanzie o altri meccanismi leciti.

source: Accounts & booking records: up to 6 years (tax/audit)
it: Account e registrazioni di prenotazione: fino a 6 anni (fisco/revisioni)

source: Marketing subscriptions: until you unsubscribe or after inactivity
it: Iscrizioni marketing: fino alla disiscrizione o dopo un periodo di inattività

source: Enquiry emails/messages: 18–24 months
it: Email/messaggi di richiesta: 18–24 mesi

source: Event photos/media: until consent is withdrawn or as stated at capture
it: Foto/media di eventi: fino a revoca del consenso o come indicato al momento della raccolta

source: Technical logs: up to 12 months (longer if needed for security)
it: Log tecnici: fino a 12 mesi (più a lungo se necessario per la sicurezza)

source: We will anonymise or securely delete data when no longer needed.
it: Anonimizzeremo o elimineremo in modo sicuro i dati quando non più necessari.

source: Access a copy of your data
it: Accedere a una copia dei tuoi dati

source: Rectify inaccuracies
it: Rettificare dati inesatti

source: Erase your data ('right to be forgotten')
it: Cancellare i tuoi dati ("diritto all’oblio")

source: Restrict certain processing
it: Limitare alcuni trattamenti

source: Object to processing based on legitimate interests or to direct marketing
it: Opporsi ai trattamenti basati su interessi legittimi o al marketing diretto

source: Data portability
it: Portabilità dei dati

source: Withdraw consent at any time where processing is based on consent
it: Revocare il consenso in qualsiasi momento quando il trattamento si basa sul consenso

source: To exercise your rights, contact us at
it: Per esercitare i tuoi diritti, contattaci a

source: You may also complain to the Information Commissioner’s Office (ICO) at ico.org.uk.
it: Puoi anche presentare un reclamo all’Information Commissioner’s Office (ICO) su ico.org.uk.

source: Our classes may be aimed at children, but our website/portal are intended for parents/guardians. We do not knowingly collect children’s data online without appropriate consent.
it: Le nostre attività possono essere rivolte ai bambini, ma il sito/portale è destinato a genitori/tutori. Non raccogliamo consapevolmente dati dei minori online senza il consenso appropriato.

source: Our site may link to third-party websites or services. Their privacy practices apply; please review their policies.
it: Il nostro sito può rimandare a siti o servizi di terzi. Si applicano le loro pratiche di privacy; ti invitiamo a consultare le loro informative.

source: We may update this policy from time to time. The current version is posted on this page with the effective date.
it: Possiamo aggiornare periodicamente questa informativa. La versione corrente è pubblicata in questa pagina con la data di efficacia.

source: 14) Contact us
it: 14) Contattaci

source: Back to top
it: Torna su

source: To explore what's happening at <b class="red">The English Studio</b> simply hover or tap any emoji on the calendar.
it: Per scoprire cosa succede a <b class="red">The English Studio</b>, passa il mouse o tocca una qualsiasi emoji nel calendario.

source: We host regular group sessions as well as one-off event's on special dates throughout the year; from seasonal celebrations to creative workshops. Be sure to check back often, as new events are added regularly. Business English, IELTS test preperation and private lessons can be arranged on an individual basis, tailored to suit you.
it: Organizziamo sessioni di gruppo regolari e eventi speciali durante tutto l'anno: dalle celebrazioni stagionali ai laboratori creativi. Torna spesso a controllare: nuovi eventi vengono aggiunti regolarmente. Corsi di Business English, preparazione IELTS e lezioni private possono essere organizzati su misura per te.

source: Ready to join an event?
it: Pronto a partecipare a un evento?

source: Use the form on our contact page to book your spot. We are happy to help with anything from bookings to general enquiries.
it: Usa il modulo nella nostra pagina dei contatti per prenotare il tuo posto. Siamo felici di aiutarti sia per le prenotazioni che per domande generiche.

source: MONTH
it: MESE

source: BOOK NOW
it: PRENOTA ORA
